export const NO = '第2回';

export const users = [
  {
    id: '0',
    name: 'sato',
    rank: 3,
    team: '',
    score: '0',
    win: ''
  },
  {
    id: '1',
    name: 'takamatsu',
    rank: 3,
    team: '',
    score: '0',
    win: ''
  },
  {
    id: '2',
    name: 'sawada',
    rank: 2,
    team: '',
    score: '0',
    win: ''
  },
  {
    id: '3',
    name: 'saitou',
    rank: 3,
    team: '',
    score: '0',
    win: ''
  },
  {
    id: '4',
    name: 'noda',
    rank: 1,
    team: '',
    score: '0',
    win: ''
  },
  {
    id: '5',
    name: 'hirano',
    rank: 5,
    team: '',
    score: '0',
    win: ''
  }
];

export const teams = [
  'ブラジル',
  'スペイン',
  'オランダ',
  'イタリア',
  'ドイツ',
  'アルゼンチン',
  'イングランド',
  'クロアチア',
  'フランス',
  'ポルトガル',
  'アメリカ合衆国',
  'ロシア',
  'スイス',
  'カメルーン',
  'チェコ',
  'ギリシャ',
  'チリ',
  'メキシコ',
  'コートジボワール',
  'セルビア',
  'パラグアイ',
  'ウクライナ',
  'ブルガリア',
  'オーストラリア',
  'ウルグアイ',
  'イスラエル',
  'デンマーク',
  'エジプト',
  'アルジェリア',
  'コロンビア',
  '北アイルランド',
  'ナイジェリア',
  'スロバキア',
  'アイルランド',
  'ホンジュラス',
  'ルーマニア',
  'ノルウェー',
  'ガーナ',
  'トルコ',
  '日本',
  'スウェーデン',
  'ボスニア・ヘルツェゴビナ',
  'コスタリカ',
  'エクアドル',
  'ガボン',
  'スコットランド',
  'ラトビア',
  '韓国',
  'スロベニア',
  'ハンガリー',
  'ベネズエラ',
  'マリ',
  'カナダ',
  'チュニジア',
  'ブルキナファソ',
  'ポーランド',
  'フィンランド',
  'オーストリア',
  'リトアニア',
  'ボリビア',
  'バーレーン',
  'イラン',
  'モロッコ',
  'サウジアラビア',
  'キプロス',
  'マケドニア共和国',
  'ベナン',
  'ベルギー',
  'ジャマイカ',
  'パナマ'
];

export const colors = {
  1: '#1e88e5',
  2: '#43a047',
  3: '#c0ca33',
  4: '#ffb300',
  5: '#f4511e'
};

export const MAXRANK = 5;

export const SEP = 2;
